Repository: KryptonGao/StudyPulse
Catalog: StudyPulse/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

source: Removes all diary entries from this device. Apple Health Mindful Session records are not removed.
ja: この端末からすべての日記を削除します。Appleヘルスのマインドフルセッション記録は削除されません。
ko: 이 기기에서 모든 일기를 삭제합니다. Apple 건강의 마음챙김 세션 기록은 삭제되지 않습니다.
zh_hans: 删除本设备上所有日记。Apple 健康中的正念记录不会被删除。
zh_hant: 刪除本裝置上所有日記。Apple 健康中的正念記錄不會被刪除。

source: Replace Current Data
ja: 現在のデータを置換
ko: 현재 데이터 교체
zh_hans: 替换当前数据
zh_hant: 取代目前資料

source: Replace current data (Recommended)
ja: 現在のデータを置換（推奨）
ko: 현재 데이터 교체(권장)
zh_hans: 替换当前数据（推荐）
zh_hant: 取代目前資料（建議）

source: Replace mode overwrites current backed-up data. A recovery point is created automatically first.
ja: 置換モードは現在の対象データを上書きします。先に復旧ポイントが自動作成されます。
ko: 교체 모드는 현재 백업 대상 데이터를 덮어씁니다. 먼저 복구 지점이 자동 생성됩니다.
zh_hans: 替换模式会覆盖当前可备份数据。操作前将自动创建恢复点。
zh_hant: 取代模式會覆寫目前可備份資料。操作前會自動建立復原點。

source: Report export failed
ja: レポートのエクスポートに失敗
ko: 보고서 내보내기 실패
zh_hans: 报告导出失败
zh_hant: 報告匯出失敗

# Report generated
source: Report generated on %@
ja: レポート生成日時：%@
ko: 보고서 생성：%@
zh_hans: 报告生成于 %@
zh_hant: 報告產生於 %@

source: Report generation failed
ja: レポート生成に失敗しました
ko: 보고서 생성 실패
zh_hans: 报告生成失败
zh_hant: 報告產生失敗

source: Report Options
ja: レポートオプション
ko: 보고서 옵션
zh_hans: 报告选项
zh_hant: 報告選項

source: Required backup file is missing: %@
ja: 必要なバックアップファイルがありません：%@
ko: 필수 백업 파일이 없습니다: %@
zh_hans: 缺少必要备份文件：%@
zh_hant: 缺少必要備份檔案：%@

source: Reschedule Notifications
ja: 通知を再設定
ko: 알림 재설정
zh_hans: 重新安排通知
zh_hant: 重新排定通知

source: Reset to Default
ja: デフォルトに戻す
ko: 기본값으로 재설정
zh_hans: 恢复默认
zh_hant: 恢復預設

source: Reset to Recommended Subjects
ja: 推奨科目にリセット
ko: 추천 과목으로 재설정
zh_hans: 重置为推荐科目
zh_hant: 重設為建議科目

source: Respiratory
ja: 呼吸数
ko: 호흡수
zh_hans: 呼吸频率
zh_hant: 呼吸頻率

source: Respiratory rate
ja: 呼吸数
ko: 호흡
zh_hans: 呼吸
zh_hant: 呼吸

source: Rest Today
ja: 今日は休息を
ko: 오늘은 휴식
zh_hans: 今天以休息为主
zh_hant: 今天以休息為主

source: Restart Now
ja: 今すぐ再起動
ko: 지금 재시작
zh_hans: 立即重启
zh_hant: 立即重新啟動

source: Resting heart rate
ja: 安静時心拍数
ko: 안정 심박수
zh_hans: 静息心率
zh_hant: 靜息心率

source: Resting heart rate is elevated
ja: 安静時心率が高め
ko: 안정 심박수 상승
zh_hans: 静息心率偏高
zh_hant: 靜息心率偏高

source: Restore completed with %d warning(s).
ja: 復元が完了しました。警告：%d 件。
ko: 복원이 완료되었습니다. 경고 %d개.
zh_hans: 恢复完成，共有 %d 条警告。
zh_hant: 還原完成，共有 %d 則警告。

source: Restore failed and the recovery point could not be reapplied: %@
ja: 復元に失敗し、復旧ポイントも再適用できませんでした：%@
ko: 복원에 실패했으며 복구 지점을 다시 적용할 수 없습니다: %@
zh_hans: 恢复失败，且无法重新应用恢复点：%@
zh_hant: 還原失敗，且無法重新套用復原點：%@

source: Restore from Backup
ja: バックアップから復元
ko: 백업에서 복원
zh_hans: 从备份恢复
zh_hant: 從備份還原

source: Restore mode
ja: 復元モード
ko: 복원 모드
zh_hans: 恢复模式
zh_hant: 還原模式

source: Restoring data…
ja: データを復元中…
ko: 데이터 복원 중…
zh_hans: 正在恢复数据…
zh_hant: 正在還原資料…

source: Resume
ja: 再開
ko: 재개
zh_hans: 继续
zh_hant: 繼續

source: Retry
ja: 再試行
ko: 재시도
zh_hans: 重试
zh_hant: 重試

source: Review All Due
ja: 全て復習
ko: 전체 복습
zh_hans: 复习全部待复习
zh_hant: 複習全部待複習

source: Review by Tag
ja: タグ別に復習
ko: 태그별 복습
zh_hans: 按标签复习
zh_hant: 按標籤複習

source: Review Frequency
ja: 復習頻度
ko: 복습 빈도
zh_hans: 复习频率
zh_hant: 複習頻率

source: Review Mistakes
ja: 間違いを復習
ko: 오답 복습
zh_hans: 复习错题
zh_hant: 複習錯題

# Review Reminder
source: Time to Reflect
ja: 振り返りリマインダー
ko: 회고 알림
zh_hans: 复盘提醒
zh_hant: 復盤提醒

source: Review the highest-risk mistake briefly.
ja: リスクの高い間違いを短時間で復習しましょう。
ko: 위험도가 가장 높은 오답을 짧게 복습하세요.
zh_hans: 简短复习风险最高的错题。
zh_hant: 簡短複習風險最高的錯題。

source: Review this card to start tracking your mastery progress
ja: このカードを復習して、習熟度の記録を開始しましょう
ko: 이 카드를 복습하여 숙지도 추적을 시작하세요
zh_hans: 复习这张卡片，开始追踪你的掌握进度
zh_hant: 複習這張卡片,開始追蹤你的掌握進度

# Review Window Closed
source: The 24h review window has closed. You can still fill it out now — useful as a delayed reflection.
ja: 24時間の振り返り時間が終了しました。今からでも記入できます。
ko: 24시간 회고 시간이 종료되었습니다. 지금 작성해도 늦지 않습니다.
zh_hans: 24h 复盘窗口已关闭。但仍可现在填写,适合作为延迟复盘。
zh_hant: 24h 復盤窗口已關閉。但仍可現在填寫,適合作為延遲復盤。

source: Review your mistakes
ja: 間違いを復習
ko: 오답 복습
zh_hans: 复习错题
zh_hant: 複習錯題

source: Review your notes now — first exam is %@
ja: 今すぐノートを復習 — 最初の試験は %@
ko: 지금 노트 복습 — 첫 시험은 %@
zh_hans: 现在复习笔记 — 第一场是 %@
zh_hant: 現在複習筆記 — 第一場是 %@

source: Reviewed
ja: 復習済
ko: 복습함
zh_hans: 已复习
zh_hant: 已複習

source: Reviewed on
ja: 振り返り日
ko: 회고일
zh_hans: 复盘于
zh_hant: 復盤於

source: reviews
ja: 回復習
ko: 회 복습
zh_hans: 次复习
zh_hant: 次複習

source: Rising
ja: 上昇
ko: 상승
zh_hans: 上升
zh_hant: 上升

# riskCategory.atRisk
source: At risk
ja: 要注意
ko: 주의
zh_hans: 需要关注
zh_hant: 需要關注

# riskCategory.critical
source: Critical
ja: 高リスク
ko: 위험
zh_hans: 高风险
zh_hant: 高風險

# riskCategory.steady
source: Steady
ja: 安定
ko: 안정
zh_hans: 稳定
zh_hant: 穩定

# riskCategory.strong
source: Strong
ja: 良好
ko: 좋음
zh_hans: 状态良好
zh_hant: 狀態良好

source: Routines
ja: ルーティン
ko: 루틴
zh_hans: 例程
zh_hant: 例程

source: rows imported
ja: 件取り込み
ko: 건 가져옴
zh_hans: 条已导入
zh_hant: 筆已匯入

source: Run Coach on more than one day to see a trend.
ja: Coach を複数日にわたって実行すると推移を確認できます。
ko: Coach를 여러 날 실행하면 추이를 확인할 수 있습니다.
zh_hans: 至少运行 Coach 两天后才能查看趋势。
zh_hant: 至少執行 Coach 兩天後才能查看趨勢。

source: Sad
ja: 悲しい
ko: 슬픔
zh_hans: 悲伤
zh_hant: 悲傷

source: Sample Size
ja: サンプル数
ko: 샘플 수
zh_hans: 样本数
zh_hant: 樣本數

source: Sat
ja: 土
ko: 토
zh_hans: 六
zh_hant: 六

source: Save
ja: 保存
ko: 저장
zh_hans: 保存
zh_hant: 儲存

source: Save Goals
ja: 目標を保存
ko: 목표 저장
zh_hans: 保存目标
zh_hant: 儲存目標

source: Save to Mistakes
ja: ミスノートに保存
ko: 오답노트에 저장
zh_hans: 保存到错题本
zh_hant: 儲存到錯題本

source: Save to Photos
ja: 写真に保存
ko: 사진에 저장
zh_hans: 保存到相册
zh_hant: 儲存到相簿

source: Save to Photos Failed
ja: 写真への保存に失敗しました
ko: 사진 저장 실패
zh_hans: 保存到相册失败
zh_hant: 儲存到相簿失敗

source: Saved and added to system Reminders.
ja: 保存し、システムリマインダーに追加しました。
ko: 저장되고 시스템 리마인더에 추가되었습니다.
zh_hans: 已保存并同步到系统提醒事项。
zh_hant: 已儲存並同步至系統提醒事項。

source: Saved and re-linked to system Reminders.
ja: 保存し、システムリマインダーと再連携しました。
ko: 저장되고 시스템 리마인더와 다시 연결되었습니다.
zh_hans: 已保存并重新关联到系统提醒事项。
zh_hant: 已儲存並重新關聯至系統提醒事項。

source: Saved to Photos
ja: 写真に保存しました
ko: 사진에 저장됨
zh_hans: 已保存到相册
zh_hant: 已儲存到相簿

source: Saved.
ja: 保存しました。
ko: 저장되었습니다.
zh_hans: 已保存。
zh_hant: 已儲存。

source: Saving...
ja: 保存中...
ko: 저장 중...
zh_hans: 保存中...
zh_hant: 儲存中...

source: Scatter Plot
ja: 散布図
ko: 산점도
zh_hans: 散点图
zh_hant: 散佈圖

source: Schedule
ja: スケジュール
ko: 일정
zh_hans: 日程
zh_hant: 日程

source: Schedule recurring study blocks like "Mon 19:00-21:00 Math mistake review".
ja: 「月 19:00-21:00 数学間違い復習」のような 繰り返しブロックをスケジュール。
ko: 「월 19:00-21:00 수학 오답 복습」같은 반복 학습 블록을 일정으로 등록하세요.
zh_hans: 安排周期性学习时间,例如 「周一 19:00-21:00 数学错题复盘」。
zh_hant: 安排週期性學習時間,例如 「週一 19:00-21:00 數學錯題複盤」。

source: School
ja: 学校
ko: 학교
zh_hans: 学校
zh_hant: 學校

source: School Info
ja: 学校情報
ko: 학교 정보
zh_hans: 学校信息
zh_hant: 學校資訊

source: School Name
ja: 学校名
ko: 학교 이름
zh_hans: 学校名称
zh_hant: 學校名稱

source: Science
ja: 理科
ko: 과학
zh_hans: 科学
zh_hant: 自然

source: Score
ja: 点数
ko: 점수
zh_hans: 分数
zh_hant: 分數

source: Score %@, fitted %@, |residual| %@
ja: 得点 %@、予測 %@、|残差| %@
ko: 점수 %@, 예측 %@, |잔차| %@
zh_hans: 得分 %@,拟合 %@,|残差| %@
zh_hant: 得分 %@,擬合 %@,|殘差| %@

source: Score Gap
ja: 点数ギャップ
ko: 점수 차이
zh_hans: 分数差距
zh_hant: 分數差距

source: Score Prediction
ja: 成績予測
ko: 성적 예측
zh_hans: 成绩预测
zh_hant: 成績預測

source: Scores
ja: 得点
ko: 점수
zh_hans: 分数
zh_hant: 分數

source: Search Guide
ja: ガイドを検索
ko: 가이드 검색
zh_hans: 搜索指南
zh_hant: 搜尋指南

source: Search mistakes...
ja: 错题を検索...
ko: 오답 검색...
zh_hans: 搜索错题...
zh_hant: 搜尋錯題...

source: Search Results
ja: 検索結果
ko: 검색 결과
zh_hans: 搜索结果
zh_hant: 搜尋結果

source: Search Results (%d)
ja: 検索結果（%d）
ko: 검색 결과 (%d)
zh_hans: 搜索结果（%d）
zh_hant: 搜尋結果（%d）

source: Search subjects or mistakes...
ja: 科目や错题を検索...
ko: 과목 또는 오답 검색...
zh_hans: 搜索科目或错题...
zh_hant: 搜尋科目或錯題...

source: Seat
ja: 座席番号
ko: 좌석 번호
zh_hans: 座位号
zh_hant: 座位號

source: Section
ja: セクション
ko: 섹션
zh_hans: 段落
zh_hant: 段落

source: See All
ja: すべて表示
ko: 전체 보기
zh_hans: 查看全部
zh_hant: 查看全部

source: See your next 5 upcoming exams.
ja: 次の5つの試験を表示します。
ko: 다음 5개의 다가오는 시험을 표시합니다.
zh_hans: 查看接下来5场即将到来的考试。
zh_hant: 查看接下來5場即將到來的考試。

source: Select
ja: 選択
ko: 선택
zh_hans: 选择
zh_hant: 選擇

source: Select a subject to view trends
ja: 科目を選択してトレンドを表示
ko: 과목을 선택하여 트렌드 보기
zh_hans: 选择科目查看趋势
zh_hant: 選擇科目查看趨勢

source: Select All
ja: すべて選択
ko: 모두 선택
zh_hans: 全选
zh_hant: 全選

source: Select at least one weekday.
ja: 少なくとも 1 つの曜日を選んでください。
ko: 최소 1 개 요일을 선택하세요.
zh_hans: 至少选择 1 个星期。
zh_hant: 至少選擇 1 個星期。

source: Select data to delete
ja: 削除するデータを選択
ko: 삭제할 데이터 선택
zh_hans: 选择要删除的数据
zh_hant: 選取要刪除的資料

source: Select Multiple Subjects
ja: 複数科目を選択
ko: 다중 과목 선택
zh_hans: 多选科目
zh_hant: 多選科目

source: Select Subject
ja: 科目を選択
ko: 과목 선택
zh_hans: 选择科目
zh_hant: 選擇科目

source: Selected
ja: 選択済み
ko: 선택됨
zh_hans: 已选择
zh_hant: 已選取

source: Selected categories will be cleared. Active tasks are not cancelled and may recreate cache data when they finish.
ja: 選択したカテゴリーを消去します。実行中の処理は中止されず、完了後にキャッシュが再生成される場合があります。
ko: 선택한 카테고리를 지웁니다. 진행 중인 작업은 취소되지 않으며 완료 후 캐시가 다시 생성될 수 있습니다.
zh_hans: 将清除所选分类。正在进行的任务不会被取消，结束后可能重新生成缓存。
zh_hant: 將清除所選分類。進行中的工作不會被取消，完成後可能重新產生快取。

source: Selection Mode
ja: 選択モード
ko: 선택 모드
zh_hans: 选择模式
zh_hant: 選擇模式

source: Send Test Notification in 5 Seconds
ja: 5秒後にローカル通知の受信テストを実行
ko: 5초 후 로컬 알림 수신 테스트 실행
zh_hans: 在 5 秒后进行本地通知接收测试
zh_hant: 在 5 秒後進行本地通知接收測試

source: Sends a minimal request to verify the endpoint, API key and model.
ja: エンドポイント、API キー、モデルを検証するための最小リクエストを送信します。
ko: 엔드포인트, API 키, 모델을 확인하기 위한 최소 요청을 보냅니다.
zh_hans: 发送一个最小请求,验证端点、API 密钥和模型可用。
zh_hant: 送出最小請求,驗證端點、API 金鑰和模型可用。

source: Server error (HTTP %d).
ja: サーバーエラー (HTTP %d)。
ko: 서버 오류 (HTTP %d).
zh_hans: 服务端错误 (HTTP %d)。
zh_hant: 伺服器錯誤 (HTTP %d)。

source: Session Complete
ja: セッション完了
ko: 세션 완료
zh_hans: 学习完成
zh_hant: 學習完成

source: Session Complete!
ja: セッション完了！
ko: 세션 완료!
zh_hans: 学习完成！
zh_hant: 學習完成！

source: Session Ended
ja: 終了しました
ko: 종료됨
zh_hans: 已结束
zh_hant: 已結束

source: Session Summary
ja: セッション概要
ko: 세션 요약
zh_hans: 本次总结
zh_hant: 本次總結

source: Set a target score per subject. You can edit later.
ja: 科目ごとに目標点を設定します。後で編集できます。
ko: 과목별 목표 점수를 설정합니다. 나중에 수정할 수 있습니다.
zh_hans: 为每个科目设目标分,稍后可编辑。
zh_hant: 為每個科目設目標分,稍後可編輯。

source: Set Base URL, API Key and Model in Settings → LLM.
ja: 設定 → LLM でエンドポイント、API キー、モデルを設定してください。
ko: 설정 → LLM에서 엔드포인트, API 키, 모델을 설정하세요.
zh_hans: 请在 设置 → LLM 中配置 API 端点、API 密钥和模型。
zh_hant: 請在 設定 → LLM 中設定 API 端點、API 金鑰和模型。

source: Set the deadline and the time you want to be reminded. The reminder time is usually earlier than the deadline.
ja: 締切と通知する日時を設定します。通知時刻は通常、締切より前にします。
ko: 마감일과 알림 시각을 설정합니다. 알림은 보통 마감 이전으로 설정합니다.
zh_hans: 设置截止日期与提醒时间，提醒时间通常早于截止日期。
zh_hant: 設定截止日期與提醒時間，提醒時間通常早於截止日期。

source: Set your daily minimums. Reach any one goal to keep your streak alive.
ja: 毎日の最低目標を設定してください。どれか一つ達成すればストリークが維持されます。
ko: 매일 최소 목표를 설정하세요. 하나라도 달성하면 스트릭이 유지됩니다.
zh_hans: 设定每日最低目标。达成任一目标即可保持连续打卡。
zh_hant: 設定每日最低目標。達成任一目標即可保持連續打卡。

source: Set your goals
ja: 目標を設定
ko: 목표 설정
zh_hans: 设定你的目标
zh_hant: 設定你的目標

source: Settings
ja: 設定
ko: 설정
zh_hans: 设置
zh_hant: 設定

source: Share Report
ja: レポートを共有
ko: 보고서 공유
zh_hans: 分享报告
zh_hant: 分享報告

source: Share Review
ja: 振り返りを共有
ko: 회고 공유
zh_hans: 分享复盘
zh_hant: 分享復盤

source: Share with Family
ja: 家族に共有
ko: 가족에게 공유
zh_hans: 分享给家人
zh_hant: 分享給家人

source: ShareAlike
ja: 継承
ko: 동일조건 변경허락
zh_hans: 相同方式共享
zh_hant: 相同方式共用

source: Show a readiness card on your Dashboard
ja: ダッシュボードに準備度カードを表示します
ko: 대시보드에 준비도 카드 표시
zh_hans: 在你的数据概览上显示准备度卡片
zh_hant: 在你的儀表板上顯示準備度卡片

source: Show Answer
ja: 答えを表示
ko: 정답 보기
zh_hans: 显示答案
zh_hant: 顯示答案

source: Show Completed
ja: 完了済みを表示
ko: 완료 항목 표시
zh_hans: 显示已完成
zh_hant: 顯示已完成

source: Show distribution across score ranges.
ja: 点数帯別の分布を円グラフで表示します。
ko: 점수 구간별 분포를 원형으로 표시합니다.
zh_hans: 按分数段展示成绩分布占比。
zh_hant: 依分數段呈現成績分佈比例。

source: Show each grade as a separate bar.
ja: 各テスト結果を独立した棒で表示します。
ko: 각 시험 성적을 개별 막대로 표시합니다.
zh_hans: 用单独的柱子表示每一次考试成绩。
zh_hant: 用單獨的柱狀表示每一次考試成績。

source: Show each grade as an independent dot.
ja: 各テスト結果を独立したドットで表示します。
ko: 각 시험 성적을 독립된 점으로 표시합니다.
zh_hans: 用独立散点表示每一次考试成绩。
zh_hant: 用獨立散點表示每一次考試成績。

source: Show grade density by weekday and week.
ja: 週・曜日ごとの試験密度をヒートマップで表示します。
ko: 주차와 요일별 시험 밀도를 히트맵으로 표시합니다.
zh_hans: 按周次与星期展示考试密度。
zh_hant: 依週次與星期呈現考試密度。

source: Show Learning Heatmap
ja: 学習ヒートマップを表示
ko: 학습 히트맵 표시
zh_hans: 显示学习热力图
zh_hant: 顯示學習熱力圖

source: Show or hide the six-dimension subject mastery radar on the Trends page.
ja: トレンドページの6次元科目習熟度レーダーを表示または非表示にします。
ko: 추세 페이지의 6차원 과목 숙련도 레이더를 표시하거나 숨깁니다.
zh_hans: 在趋势页显示或隐藏六维科目掌握度雷达。
zh_hant: 在趨勢頁顯示或隱藏六維科目掌握度雷達。

source: Show Preview
ja: プレビューを表示
ko: 미리보기 표시
zh_hans: 显示预览
zh_hant: 顯示預覽

source: Show score trend over time with connected points.
ja: 折れ線で成績の推移を表示します。
ko: 시간에 따른 성적 추세를 연결된 선으로 표시합니다.
zh_hans: 用连接的折线展示成绩随时间变化的趋势。
zh_hant: 用連接的折線展示成績隨時間變化的趨勢。

source: Show Subject Mastery Radar
ja: 科目習熟度レーダーを表示
ko: 과목 숙련도 레이더 표시
zh_hans: 显示科目掌握度雷达
zh_hant: 顯示科目掌握度雷達

source: Showing all data (no active phase)
ja: すべてのデータを表示中(有効なフェーズなし)
ko: 모든 데이터 표시 중(활성 단계 없음)
zh_hans: 正在显示全部数据(无激活阶段)
zh_hant: 正在顯示全部資料(無啟用階段)

source: Single Subject
ja: 単一科目
ko: 단일 과목
zh_hans: 单科
zh_hant: 單科

source: Skip
ja: スキップ
ko: 건너뛰기
zh_hans: 跳过
zh_hant: 略過

source: Skip for now
ja: 今はスキップ
ko: 지금은 건너뛰기
zh_hans: 暂时跳过
zh_hant: 暫時跳過

source: Skip syncing to system Reminders. You can manage this task only inside StudyPulse.
ja: リマインダーへ同期せず、StudyPulse 内のみで管理します。
ko: 시스템 리마인더에 동기화하지 않고 StudyPulse 내에서만 관리합니다.
zh_hans: 不同步到系统提醒事项，只在 StudyPulse 内管理。
zh_hant: 不同步至系統提醒事項，只在 StudyPulse 內管理。

source: skipped
ja: スキップ
ko: 건너뜀
zh_hans: 已跳过
zh_hant: 已略過

source: Sleep was a bit short
ja: 睡眠時間がやや短い
ko: 수면이 약간 부족
zh_hans: 睡眠偏少
zh_hant: 睡眠偏少

# Socre:
source: Score:
ja: 点数：
ko: 점수：
zh_hans: 分数：
zh_hant: 分數：

source: Some Cache Could Not Be Cleared
ja: 一部のキャッシュを消去できませんでした
ko: 일부 캐시를 지울 수 없습니다
zh_hans: 部分缓存无法清除
zh_hant: 部分快取無法清除

source: Source
ja: 出典
ko: 출처
zh_hans: 来源
zh_hant: 來源

source: Source: %@
ja: 出典：%@
ko: 출처: %@
zh_hans: 来源：%@
zh_hant: 來源：%@

source: Spaced Repetition
ja: 間隔反復
ko: 간격 반복
zh_hans: 间隔重复
zh_hant: 間隔重複

source: Special
ja: 特別
ko: 특별
zh_hans: 特殊
zh_hant: 特殊

source: Specific Exam Title or Notes
ja: 具体的な試験名またはメモ
ko: 구체적인 시험명 또는 메모
zh_hans: 具体考试标题或备注
zh_hant: 具體考試標題或備註

source: Stability
ja: 心理的安定性
ko: 심리적 안정성
zh_hans: 心理稳定性
zh_hant: 心理穩定性

source: Stable
ja: 安定
ko: 안정
zh_hans: 稳定
zh_hant: 穩定

source: Stage
ja: 段階
ko: 단계
zh_hans: 阶段
zh_hant: 階段

source: Start
ja: 開始
ko: 시작
zh_hans: 开始
zh_hant: 開始

source: Start a conversation
ja: 会話を始める
ko: 대화 시작
zh_hans: 开始对话
zh_hant: 開始對話

source: Start adding grades to get suggestions!
ja: 成績の追加を始めて提案を受け取りましょう！
ko: 성적을 추가하여 제안을 받아보세요!
zh_hans: 开始添加成绩以获取学习建议！
zh_hant: 開始新增成績以獲取學習建議！

source: Start Date
ja: 開始日
ko: 시작일
zh_hans: 开始日期
zh_hant: 開始日期

source: Start Focus
ja: 集中開始
ko: 집중 시작
zh_hans: 开始专注
zh_hant: 開始專注

source: Start Review
ja: 復習を開始
ko: 복습 시작
zh_hans: 开始复习
zh_hant: 開始複習

source: Start Time
ja: 開始時間
ko: 시작 시간
zh_hans: 开始时间
zh_hant: 開始時間

source: Start Using StudyPulse
ja: StudyPulse を始める
ko: StudyPulse 시작하기
zh_hans: 开始使用 StudyPulse
zh_hant: 開始使用 StudyPulse

source: Starts in %d min
ja: %d 分後に開始
ko: %d 분 후 시작
zh_hans: %d 分钟后开始
zh_hant: %d 分鐘後開始

source: Status
ja: 状態
ko: 상태
zh_hans: 状态
zh_hant: 狀態

source: Steady Rhythm
ja: ステディリズム
ko: 안정적 리듬
zh_hans: 稳态节奏
zh_hant: 穩態節奏

source: Storage & Cache
ja: ストレージとキャッシュ
ko: 저장 공간 및 캐시
zh_hans: 存储与缓存
zh_hant: 儲存空間與快取

source: Streak
ja: ストリーク
ko: 스트릭
zh_hans: 连续打卡
zh_hant: 連續打卡

# streak.card.allGoalsMet
source: All goals met today!
ja: 今日の目標をすべて達成！
ko: 오늘 목표 모두 달성!
zh_hans: 今日目标全部达成！
zh_hant: 今日目標全部達成！

# streak.card.goalsToday
source: %d/%d goals today
ja: 今日 %d/%d 目標
ko: 오늘 %d/%d 목표
zh_hans: 今日 %d/%d 目标
zh_hant: 今日 %d/%d 目標

# streak.card.longest
source: Longest %d
ja: 最長 %d
ko: 최장 %d
zh_hans: 历史最长 %d
zh_hant: 歷史最長 %d

# streak.card.noActivity
source: Start your first session today
ja: 最初の学習を始めましょう
ko: 첫 학습을 시작하세요
zh_hans: 开始你的第一节学习吧
zh_hant: 開始你的第一節學習吧

# streak.card.title
source: %d-day streak
ja: %d日連続
ko: %d일 연속
zh_hans: 已连续 %d 天
zh_hant: 已連續 %d 天

source: Strong
ja: 強い
ko: 강함
zh_hans: 强
zh_hant: 強

source: Struggling
ja: 苦戦中
ko: 고민 중
zh_hans: 还在挣扎
zh_hant: 仍在掙扎

source: Student ID
ja: 生徒 ID
ko: 학생 ID
zh_hans: 学号
zh_hant: 學號

source: Study
ja: 学習
ko: 학습
zh_hans: 学习
zh_hant: 學習

source: Study Block
ja: 学習ブロック
ko: 학습 블록
zh_hans: 学习块
zh_hant: 學習塊

source: Study Diary
ja: 学習日記
ko: 학습 일기
zh_hans: 学习日记
zh_hant: 學習日記

source: Study Minutes
ja: 学習時間(分)
ko: 학습 시간(분)
zh_hans: 学习分钟
zh_hant: 學習分鐘

source: Study Phase
ja: 学習フェーズ
ko: 학습 단계
zh_hans: 学习阶段
zh_hant: 學習階段

source: Study Phases
ja: 学習フェーズ
ko: 학습 단계
zh_hans: 学习阶段
zh_hant: 學習階段

source: Study Suggestions
ja: 学習の提案
ko: 학습 제안
zh_hans: 学习建议
zh_hant: 學習建議

source: Study Time
ja: 学習時間
ko: 학습 시간
zh_hans: 学习时长
zh_hant: 學習時長

source: Study Timer
ja: 学習タイマー
ko: 학습 타이머
zh_hans: 学习计时器
zh_hant: 學習計時器

source: StudyPulse also reads your heart rate, breathing rate, and last night's sleep to recommend the right kind of study session for your body.
ja: StudyPulse は心拍数、呼吸数、昨夜の睡眠も読み取り、その時の体の状態に合った学習方法を提案します。
ko: StudyPulse는 심박수, 호흡수, 어젯밤 수면도 읽어 현재 몸 상태에 맞는 공부 방식을 추천합니다.
zh_hans: StudyPulse 还会读取你的心率、呼吸频率和昨晚的睡眠，为你推荐适合当前身体状态的学习方式。
zh_hant: StudyPulse 還會讀取你的心率、呼吸頻率和昨晚的睡眠，為你推薦適合當下身體狀態的學習方式。

source: StudyPulse does not have calendar access. Please enable it in Settings.
ja: StudyPulse はカレンダーへのアクセス権限がありません。設定で有効にしてください。
ko: StudyPulse는 캘린더 접근 권한이 없습니다. 설정에서 활성화하세요.
zh_hans: StudyPulse 没有日历访问权限。请在设置中开启。
zh_hant: StudyPulse 沒有日曆存取權限。請在設定中開啟。

source: StudyPulse helps students track performance and manage study materials. StudyPulse 成绩追踪与学习资料管理应用
ja: StudyPulse は学生が学業の進捗を追跡し、学習資料を管理するのを支援します。 StudyPulse 成績追跡と学習資料管理アプリ
ko: StudyPulse는 학생이 학습 진행 상황을 추적하고 학습 자료를 관리하도록 도와줍니다. StudyPulse 성적 추적 및 학습 자료 관리 앱
zh_hant: StudyPulse 幫助學生追蹤學習表現並管理學習資料。 StudyPulse 成績追蹤與學習資料管理應用

source: StudyPulse is a comprehensive learning management application designed to help students track their academic performance, analyze trends, and manage their study materials effectively.
ja: StudyPulseは、学生が学業の進捗を追跡し、傾向を分析し、学習教材を効果的に管理できるように設計された総合的な学習管理アプリケーションです。
ko: StudyPulse는 학생들이 학업 성과를 추적하고 추세를 분석하며 학습 자료를 효과적으로 관리할 수 있도록 설계된 종합 학습 관리 애플리케이션입니다.
zh_hans: StudyPulse 是一款综合性学习管理应用，旨在帮助学生追踪学业表现、分析学习趋势，并高效管理学习资料。
zh_hant: StudyPulse 是一款綜合性學習管理應用程式，旨在幫助學生追蹤學業表現、分析學習趨勢，並高效管理學習資料。

source: StudyPulse Learning Report
ja: StudyPulse 学習レポート
ko: StudyPulse 학습 보고서
zh_hans: StudyPulse 学习报告
zh_hant: StudyPulse 學習報告

source: StudyPulse never proxies your requests. The endpoint receives your API key directly.
ja: StudyPulse はリクエストを中継しません。API キーは指定したエンドポイントに直接送信されます。
ko: StudyPulse는 요청을 중계하지 않습니다. API 키는 입력한 엔드포인트로 직접 전송됩니다.
zh_hans: StudyPulse 不会代理你的请求,API 密钥会直接发送到你填写的端点。
zh_hant: StudyPulse 不會代理你的請求,API 金鑰會直接發送到你填寫的端點。

source: StudyPulse only reads HRV from HealthKit with your explicit permission. We do not write any data.
ja: StudyPulse はあなたの明示的な許可のもと、HealthKit から HRV を読み取るだけです。書き込みは一切行いません。
ko: StudyPulse는 명시적 권한하에 HealthKit에서 HRV를 읽기만 합니다. 데이터를 쓰지 않습니다.
zh_hans: StudyPulse 只会经过你的明确许可从健康应用读取 HRV。我们不会写入任何数据。
zh_hant: StudyPulse 只會經過你的明確許可從健康應用讀取 HRV。我們不會寫入任何資料。

source: StudyPulse stores all grade data locally on your device as JSON files. You can add scores, rankings, importance levels, and even attach a photo of your graded paper. Grades are organized by subject and can be viewed in trend charts over time.
ja: StudyPulseはすべての成績データをJSONファイルとして端末のローカルに保存します。点数、順位、重要度に加え、採点済みの答案写真を添付することもできます。成績は科目ごとに整理され、経時的なトレンドグラフで確認できます。
ko: StudyPulse는 모든 성적 데이터를 JSON 파일로 기기 로컬에 저장합니다. 점수, 순위, 중요도 수준을 추가할 수 있으며 채점된 시험지 사진도 첨부할 수 있습니다. 성적은 과목별로 정리되며 시간에 따른 추세 차트로 확인할 수 있습니다.
zh_hans: StudyPulse 将所有成绩数据以 JSON 文件形式存储在设备本地。您可以添加分数、排名、重要级别，甚至附加批改后的试卷照片。成绩按科目组织，并可通过趋势图表查看随时间的变化。
zh_hant: StudyPulse 將所有成績數據以 JSON 文件形式存儲在設備本地。您可以添加分數、排名、重要級別，甚至附加批改後的試卷照片。成績按科目組織，並可通過趨勢圖表查看隨時間的變化。

source: StudyPulse supports 15+ education systems including: Mainland China (National, Zhejiang, Shanghai), Taiwan, Hong Kong, Singapore, UK (IGCSE, A-Level), IB DP, US (AP, SAT, ACT), GRE/GMAT, and TOEFL/IELTS. You can select your education system in Settings > Profile, and subject full scores will be configured automatically.
ja: StudyPulseは15以上の教育システムに対応しています：中国大陸（全国、浙江、上海）、台湾、香港、シンガポール、英国（IGCSE、A-Level）、IB DP、米国（AP、SAT、ACT）、GRE/GMAT、TOEFL/IELTSなど。「設定 > プロフィール」で教育システムを選択すると、科目の満点が自動設定されます。
ko: StudyPulse는 15개 이상의 교육 시스템을 지원합니다: 중국 본토(전국, 저장, 상하이), 대만, 홍콩, 싱가포르, 영국(IGCSE, A-Level), IB DP, 미국(AP, SAT, ACT), GRE/GMAT, TOEFL/IELTS 등. 「설정 > 프로필」에서 교육 시스템을 선택하면 과목별 만점이 자동으로 설정됩니다.
zh_hans: StudyPulse 支持 15 种以上教育体系，包括：中国大陆（全国、浙江、上海）、台湾、香港、新加坡、英国（IGCSE、A-Level）、IB DP、美国（AP、SAT、ACT）、GRE/GMAT 和 TOEFL/IELTS。您可以在「设置 > 个人资料」中选择教育体系，科目满分将自动配置。
zh_hant: StudyPulse 支援 15 種以上教育體系，包括：中國大陸（全國、浙江、上海）、台灣、香港、新加坡、英國（IGCSE、A-Level）、IB DP、美國（AP、SAT、ACT）、GRE/GMAT 和 TOEFL/IELTS。您可以在「設定 > 個人資料」中選擇教育體系，科目滿分將自動配置。

source: Subject
ja: 科目
ko: 과목
zh_hans: 科目
zh_hant: 科目

source: Subject Averages
ja: 科目別平均
ko: 과목 평균
zh_hans: 科目平均分
zh_hant: 科目平均

source: Subject list reset for the new system
ja: 新しいシステムに合わせて科目をリセットしました
ko: 새 체계에 맞춰 과목 목록을 초기화했습니다
zh_hans: 已按新体系重置选科列表
zh_hant: 已按新體系重置選科清單

source: Subject Mastery Radar
ja: 科目習熟度レーダー
ko: 과목 숙련도 레이더
zh_hans: 科目掌握度雷达
zh_hant: 科目掌握度雷達

source: Subject name
ja: 科目名
ko: 과목 이름
zh_hans: 科目名称
zh_hant: 科目名稱

source: Subject Trend
ja: 科目トレンド
ko: 과목 트렌드
zh_hans: 科目趋势
zh_hant: 科目趨勢

source: Subjects
ja: 科目
ko: 과목
zh_hans: 科目
zh_hant: 科目

source: Subjects and weights
ja: 科目と重み
ko: 과목 및 가중치
zh_hans: 科目与权重
zh_hant: 科目與權重

source: Subjects Needing Attention
ja: 注意が必要な科目
ko: 주의가 필요한 과목
zh_hans: 需要关注的科目
zh_hant: 需要關注的科目

source: Submit & Show Answer
ja: <#ja#>
ko: <#ko#>
zh_hans: 提交并显示答案
zh_hant: <#zh-Hant#>

source: Submit Answer
ja: <#ja#>
ko: <#ko#>
zh_hans: 提交答案
zh_hant: <#zh-Hant#>

source: Submit when done
ja: <#ja#>
ko: <#ko#>
zh_hans: 完成后请提交
zh_hant: <#zh-Hant#>

source: Success probability: %.0f%%
ja: 達成確率：%.0f%%
ko: 달성 확률: %.0f%%
zh_hans: 达成概率：%.0f%%
zh_hant: 達成機率：%.0f%%

source: Successfully added to calendar!
ja: カレンダーに追加しました！
ko: 캘린더에 성공적으로 추가되었습니다!
zh_hans: 已成功添加到日历！
zh_hant: 已成功加入行事曆！

source: Suggested
ja: 提案
ko: 제안됨
zh_hans: 建议
zh_hant: 建議

source: Suggested for Review
ja: 復習を推奨
ko: 복습 권장
zh_hans: 建议复习
zh_hant: 建議複習

source: Suggestion Only
ja: 提案のみ
ko: 제안만
zh_hans: 仅显示建议
zh_hant: 僅顯示建議

source: Summary
ja: 概要
ko: 개요
zh_hans: 概览
zh_hant: 概覽

source: Sun
ja: 日
ko: 일
zh_hans: 日
zh_hant: 日

source: Superseded
ja: 置き換え済み
ko: 대체됨
zh_hans: 已被替代
zh_hant: 已被取代

source: Switch to List
ja: リストに切替
ko: 목록으로 전환
zh_hans: 切换为列表
zh_hant: 切換為列表

source: Sync to Apple Health
ja: Appleヘルスに同期
ko: Apple 건강에 동기화
zh_hans: 同步到 Apple 健康
zh_hant: 同步到 Apple 健康

source: Sync with System Reminders
ja: システムリマインダーと同期
ko: 시스템 리마인더와 동기화
zh_hans: 同步到系统提醒事项
zh_hant: 同步至系統提醒事項

source: Synced
ja: 同期済み
ko: 동기화됨
zh_hans: 已同步
zh_hant: 已同步

source: Synced with the system Reminders app.
ja: システムリマインダーと同期済みです。
ko: 시스템 리마인더와 동기화되었습니다.
zh_hans: 已与系统提醒事项同步。
zh_hant: 已與系統提醒事項同步。

source: System Default
ja: システム標準
ko: 시스템 기본
zh_hans: 跟随系统
zh_hant: 跟隨系統

source: System Prompt Appendix
ja: システムプロンプト追記
ko: 시스템 프롬프트 추가
zh_hans: 系统提示词追加
zh_hant: 系統提示詞追加

source: Table of Contents
ja: 目次
ko: 목차
zh_hans: 目录
zh_hant: 目錄

source: Tag Graph
ja: タググラフ
ko: 태그 그래프
zh_hans: 标签图谱
zh_hant: 標籤圖譜

source: Tag suggestions
ja: タグ候補
ko: 태그 추천
zh_hans: 标签建议
zh_hant: 標籤建議

source: Tags
ja: タグ
ko: 태그
zh_hans: 标签
zh_hant: 標籤

source: Take it easy today
ja: 今日は無理せず
ko: 오늘은 편하게
zh_hans: 今天放轻松
zh_hant: 今天放輕鬆

source: Take Photo
ja: 写真を撮る
ko: 사진 촬영
zh_hans: 拍照
zh_hant: 拍照

source: Tap '+' to add a homework, reading material, or exam.
ja: + をタップして宿題・読書・試験を追加
ko: + 버튼을 눌러 숙제, 독서 또는 시험을 추가하세요.
zh_hans: 点击右上角 + 添加作业、阅读材料或考试
zh_hant: 點擊右上角 + 新增作業、閱讀材料或考試

source: Tap '+' to add a new exam.
ja: 「+」をタップして試験を追加
ko: '+'를 탭하여 시험 추가
zh_hans: 点击 + 号添加考试
zh_hant: 點擊 + 號新增考試

source: Tap '+' to add a new mistake note.
ja: + をタップして間違いノートを追加。
ko: + 를 탭하여 새 오답 노트를 추가하세요.
zh_hans: 点击 + 号添加新的错题笔记。
zh_hant: 點擊 + 號新增錯題筆記。

source: Tap + to log mood
ja: + をタップして気分を記録
ko: + 를 탭하여 기분 기록
zh_hans: 点 + 记录心情
zh_hant: 點 + 記錄心情
